OpenNuvoton/M2354BSP/SampleCode/SecureApplication/SecureOTABankSwapDemo/NuBL2/NuBL2_lib0.c
    /* Step 4. Authenticate NuBL3x info Hash */
    /* Calculate NuBL3x info Hash */
    start = (uint32_t)&FwInfo;
    end   = (uint32_t)&FwInfo.sign.au32R[0];
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);

    if(NuBL2_VerifyNuBL3xECDSASignature((uint32_t *)Hash, (ECDSA_SIGN_T *)&FwInfo.sign.au32R[0], (ECC_PUBKEY_T *)&PubKey.au32Key0[0], mode) != 0)
    {
        uint32_t *tmp0;
        tmp0 = (uint32_t *)&FwInfo.sign.au32R[0];
        NUBL_MSG("Authenticate NuBL3%d info signature [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        NUBL_MSG("Get signature:\n");
        for(i = 0; i < (sizeof(ECDSA_SIGN_T) / 4); i++)
            NUBL_MSG("\t%d: 0x%08x.\n", i, tmp0[i]);
        ret = -4001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    NUBL_MSG("Authenticate NuBL3%d info signature [PASS]\n\n", ((mode & BIT0) == 0) ? 2 : 3);



    /* Step 5. Verify NuBL3x F/W Hash */
    if((mode & BIT4) != BIT4) /* if BIT4 == 0, dnubo not check F/W integrity */
    {
        uint32_t au32Hash[8];

        start = FwInfo.mData.au32FwRegion[1].u32Start;
        end   = start + FwInfo.mData.au32FwRegion[1].u32Size;
        /* if start address and size are both 0x0, it means no second firmware. */
        if((start == 0x0) && (end == 0x0))
        {
            if(u32BankIdx == 0)
                start = FwInfo.mData.au32FwRegion[0].u32Start;
            else
                start = FwInfo.mData.au32FwRegion[0].u32Start | FMC_BANK_SIZE;

            if(FMC->ISPSTS & FMC_ISPSTS_FBS_Msk)
                start |= FMC_BANK_SIZE;

            end   = start + FwInfo.mData.au32FwRegion[0].u32Size;
            /* Calculate NuBL3x F/W Hash (use PubKey buffer to store NuBL3x F/W Hash) */
            memset(&au32Hash, 0x0, sizeof(au32Hash));
            NuBL_CalculateSHA256(start, end, (uint32_t *)au32Hash, SHA_ONESHOT, SHA_SRC_FLASH);
        }
        else
        {
            if(u32BankIdx == 0)
                start = FwInfo.mData.au32FwRegion[0].u32Start;
            else
                start = FwInfo.mData.au32FwRegion[0].u32Start | FMC_BANK_SIZE;

            if(FMC->ISPSTS & FMC_ISPSTS_FBS_Msk)
                start |= FMC_BANK_SIZE;

            end   = start + FwInfo.mData.au32FwRegion[0].u32Size;
            /* Calculate NuBL3x F/W Hash (use PubKey buffer to store NuBL3x F/W Hash) */
            memset(&au32Hash, 0x0, sizeof(au32Hash));
            NuBL_CalculateSHA256(start, end, (uint32_t *)au32Hash, SHA_CONTI_START, SHA_SRC_FLASH);

            if(u32BankIdx == 0)
                start = FwInfo.mData.au32FwRegion[1].u32Start;
            else
                start = FwInfo.mData.au32FwRegion[1].u32Start | FMC_BANK_SIZE;

            if(FMC->ISPSTS & FMC_ISPSTS_FBS_Msk)
                start |= FMC_BANK_SIZE;

            end   = start + FwInfo.mData.au32FwRegion[1].u32Size;
            NuBL_CalculateSHA256(start, end, (uint32_t *)au32Hash, SHA_CONTI_END, SHA_SRC_FLASH);
        }

        if(memcmp(&au32Hash[0], &FwInfo.au32FwHash[0], (HASH_SIZE / 8)) != 0)
        {
            uint32_t *tmp;
            tmp = (uint32_t *)&au32Hash;
            NUBL_MSG("Verify NuBL3%d F/W Hash [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
            NUBL_MSG("F/W Hash:\n");
            for(i = 0; i < ((HASH_SIZE / 8) / 4); i++)
                NUBL_MSG("\t%d: 0x%08x - 0x%08x.\n", i, tmp[i], FwInfo.au32FwHash[i]);
            ret = -5001;
            goto _exit_NuBL2_ExecuteVerifyNuBL3x;
        }
        NUBL_MSG("Verify NuBL3%d F/W Hash [PASS]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
    }
    ret = 0;

_exit_NuBL2_ExecuteVerifyNuBL3x:
    SYS_ResetModule(CRPT_RST);

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&Hash,   0x0, sizeof(Hash));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));
    memset(&FwInfo, 0x0, sizeof(FW_INFO_T));

    return ret;
}

/**
  * @brief      Perform NuBL2 to verify NuBL32 or NuBL33 F/W
  * @param[in]  mode        bit-0: 0:verify NuBL32; 1:verify NuBL33 \n
  *                         bit-4: 0:Integrity check; 1:Identify check
  * @retval     0           Success
  * @retval     others      Failed
  * @details    This function is used to perform identify, authenticate and verify F/W integrity of NuBL32 or NuBL33. \n
  *             Flow: \n
  *                 1. Decrypt(use NuBL2 AES key) Key Storage to get NuBL32x public key \n
  *                 2. Decrypt(use NuBL2&NuBL3x ECDH key) NuBL3x info \n
  *                 3. Identify NuBL3x public key \n
  *                 4. Authenticate NuBL3x info Hash \n
  *                 5. Verify NuBL3x F/W Hash \n
  */
int32_t NuBL2_ExecuteVerifyNuBL3x(uint32_t *buf, int32_t mode)
{
    volatile int32_t    i, ret = -1000;
    uint32_t            *keybuf, *infobuf, base, len, start, end;
    ECC_PUBKEY_T        PubKey;
    FW_INFO_T           FwInfo;
    uint32_t            AESkey[8], Hash[8], HashValue[8];

    if(!((mode == 0) || (mode == 1) || (mode == 0x010) || (mode == 0x011)))
    {
        NUBL_MSG("\nNuBL2 verify NuBL3x FAIL. Invalid mode: 0x%x.\n\n", mode);
        return ret;
    }

    if((ret = IsAccessDenied()) != 0)
        return ret;

    NUBL_MSG("\nNuBL2 verify NuBL3%d. \n\n", ((mode & BIT0) == 0) ? 2 : 3);

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));
    memset(&FwInfo, 0x0, sizeof(FW_INFO_T));

    if(buf == NULL)
        infobuf = (uint32_t *)&FwInfo;
    else
        infobuf = buf;

    /* Check NuBL3x Key Storage Hash */
    /* Get encrypted NuBL3x public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    if((mode & BIT0) == 0)
    {
        extern uint32_t g_NuBL32EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL32EnCryptPubKeyBase;  /* encrypted NuBL32 pub key address */
    }
    else
    {
        extern uint32_t g_NuBL33EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL33EnCryptPubKeyBase;  /* encrypted NuBL33 pub key address */
    }

    /* inpw() is cpu read, so logical address do not add 0x80000 */

    keybuf = (uint32_t *)&PubKey;
    for(i = 0; i < (len / 4); i++)
        keybuf[i] = inpw(base + (i * 4));

    start = (uint32_t)&PubKey;
    end   = (uint32_t)&PubKey + len;
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);

    /* Get encrypted NuBL3x public key from Key Storage Hash base */
    len = sizeof(ECC_PUBKEY_T);
    if((mode & BIT0) == 0)
    {
        extern uint32_t g_NuBL32EnCryptPubKeyHashBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL32EnCryptPubKeyHashBase;  /* encrypted NuBL32 pub key hash address */
    }
    else
    {
        extern uint32_t g_NuBL33EnCryptPubKeyHashBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL33EnCryptPubKeyHashBase;  /* encrypted NuBL33 pub key hash address */
    }

    /* inpw() is cpu read, so logical address do not add 0x80000 */

    start = base;
    end   = base + sizeof(Hash);
    keybuf = (uint32_t *)&HashValue;
    for(i = 0; i < (sizeof(HashValue) / 4); i++)
        keybuf[i] = inpw(base + (i * 4));

    if(memcmp(&Hash[0], &HashValue[0], (HASH_SIZE / 8)) != 0)
    {
        uint32_t *tmp;
        tmp = (uint32_t *)&Hash;
        NUBL_MSG("Verify NuBL3%d F/W Hash [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        NUBL_MSG("F/W Hash:\n");
        for(i = 0; i < ((HASH_SIZE / 8) / 4); i++)
            NUBL_MSG("\t%d: 0x%08x - 0x%08x.\n", i, Hash[i], HashValue[i]);
        ret = -5001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    NUBL_MSG("Verify NuBL3%d Key Storage Hash [PASS]\n\n", ((mode & BIT0) == 0) ? 2 : 3);

    /* Step 1. Decrypt NuBL3x public key */
    /* Get AES256key for follows AES decryption */
    GetNuBL2AES256Key(AESkey);
    NUBL_MSG("AES256 decryption keys:\n");
    for(i = 0; i < 8; i++)
        NUBL_MSG("\t0x%08x.\n", AESkey[i]);

    /* Get encrypted NuBL3x public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    if((mode & BIT0) == 0)
    {
        extern uint32_t g_NuBL32EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL32EnCryptPubKeyBase;  /* encrypted NuBL32 pub key address */
    }
    else
    {
        extern uint32_t g_NuBL33EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
        base = (uint32_t)&g_NuBL33EnCryptPubKeyBase;  /* encrypted NuBL33 pub key address */
    }
    /* inpw() is cpu read, so logical address do not add 0x80000 */

    keybuf = (uint32_t *)&PubKey;
    for(i = 0; i < (len / 4); i++)
        keybuf[i] = inpw(base + (i * 4));

    /* Trigger decryption... */
    if(NuBL_AES256Decrypt(keybuf, keybuf, len, AESkey) != 0)
    {
        ret = -1003;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    NUBL_MSG("Decrypt NuBL3%d public key [Done]\n\n", ((mode & BIT0) == 0) ? 2 : 3);


    /* Step 2. Decrypt or get NuBL3x info */
    /* Get NuBL3x F/W info */
    len = sizeof(FW_INFO_T);
    if((mode & BIT4) != BIT4)
    {
        if((mode & BIT0) == 0)
            base = NUBL32_FW_INFO_BASE;   // NuBL32 F/W info address
        else
            base = NUBL33_FW_INFO_BASE;   // NuBL33 F/W info address

        /* inpw() is cpu read, so logical address do not add 0x80000 */
        NUBL_MSG("CPU read - FW Info base: 0x%08X\n", base);
        for(i = 0; i < (len / 4); i++)
            infobuf[i] = inpw(base + (i * 4));
    }
    NUBL_MSG("Get NuBL3%d F/W info [Done]\n\n", ((mode & BIT0) == 0) ? 2 : 3);


    /* Step 3. Identify NuBL3x public key (encloed in Key Storage and F/W info) */
    memcpy(&FwInfo, infobuf, sizeof(FW_INFO_T));
#if defined(DIRECT_VERIFY_NUBL3x_PUBKEY)
    if(memcmp(&PubKey.au32Key0[0], &FwInfo.pubkey.au32Key0[0], sizeof(ECC_PUBKEY_T)) != 0)
    {
        NUBL_MSG("Identify NuBL3%d public key [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        ret = -3001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
#else
    start = (uint32_t)&PubKey.au32Key0[0];
    end   = start + sizeof(ECC_PUBKEY_T) / 2;
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);
    if(memcmp((uint32_t *)Hash, &FwInfo.pubkey.au32Key0[0], sizeof(Hash)) != 0)
    {
        NUBL_MSG("Identify NuBL3%d public key [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        ret = -3001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    start = (uint32_t)&PubKey.au32Key1[0];
    end   = start + sizeof(ECC_PUBKEY_T) / 2;
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);
    if(memcmp((uint32_t *)Hash, &FwInfo.pubkey.au32Key1[0], sizeof(Hash)) != 0)
    {
        NUBL_MSG("Identify NuBL3%d public key [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        ret = -3001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
#endif
    NUBL_MSG("Identify NuBL3%d public key [PASS]\n\n", ((mode & BIT0) == 0) ? 2 : 3);


