OpenNuvoton/M2354BSP/SampleCode/SecureApplication/SecureOTABankSwapDemo/NuBL2/NuBL2_lib0.c
    /* Step 4. Authenticate NuBL3x info Hash */
    /* Calculate NuBL3x info Hash */
    start = (uint32_t)&FwInfo;
    end   = (uint32_t)&FwInfo.sign.au32R[0];
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);

    if(NuBL2_VerifyNuBL3xECDSASignature((uint32_t *)Hash, (ECDSA_SIGN_T *)&FwInfo.sign.au32R[0], (ECC_PUBKEY_T *)&PubKey.au32Key0[0], mode) != 0)
    {
        uint32_t *tmp0;
        tmp0 = (uint32_t *)&FwInfo.sign.au32R[0];
        NUBL_MSG("Authenticate NuBL3%d info signature [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
        NUBL_MSG("Get signature:\n");
        for(i = 0; i < (sizeof(ECDSA_SIGN_T) / 4); i++)
            NUBL_MSG("\t%d: 0x%08x.\n", i, tmp0[i]);
        ret = -4001;
        goto _exit_NuBL2_ExecuteVerifyNuBL3x;
    }
    NUBL_MSG("Authenticate NuBL3%d info signature [PASS]\n\n", ((mode & BIT0) == 0) ? 2 : 3);



    /* Step 5. Verify NuBL3x F/W Hash */
    if((mode & BIT4) != BIT4) /* if BIT4 == 0, dnubo not check F/W integrity */
    {
        uint32_t au32Hash[8];

        start = FwInfo.mData.au32FwRegion[1].u32Start;
        end   = start + FwInfo.mData.au32FwRegion[1].u32Size;
        /* if start address and size are both 0x0, it means no second firmware. */
        if((start == 0x0) && (end == 0x0))
        {
            start = FwInfo.mData.au32FwRegion[0].u32Start;

            if(FMC->ISPSTS & FMC_ISPSTS_FBS_Msk)
                start |= FMC_BANK_SIZE;

            NUBL_MSG("region[0]Start: 0x%08X\n", start);
            end   = start + FwInfo.mData.au32FwRegion[0].u32Size;
            /* Calculate NuBL3x F/W Hash (use PubKey buffer to store NuBL3x F/W Hash) */
            memset(&au32Hash, 0x0, sizeof(au32Hash));
            NuBL_CalculateSHA256(start, end, (uint32_t *)au32Hash, SHA_ONESHOT, SHA_SRC_FLASH);
        }
        else
        {
            start = FwInfo.mData.au32FwRegion[0].u32Start;

            if(FMC->ISPSTS & FMC_ISPSTS_FBS_Msk)
                start |= FMC_BANK_SIZE;
            NUBL_MSG("region[0]Start: 0x%08X\n", start);
            end   = start + FwInfo.mData.au32FwRegion[0].u32Size;
            /* Calculate NuBL3x F/W Hash (use PubKey buffer to store NuBL3x F/W Hash) */
            memset(&au32Hash, 0x0, sizeof(au32Hash));
            NuBL_CalculateSHA256(start, end, (uint32_t *)au32Hash, SHA_CONTI_START, SHA_SRC_FLASH);

            start = FwInfo.mData.au32FwRegion[1].u32Start;

            if(FMC->ISPSTS & FMC_ISPSTS_FBS_Msk)
                start |= FMC_BANK_SIZE;
            NUBL_MSG("region[1]Start: 0x%08X\n", start);
            end   = start + FwInfo.mData.au32FwRegion[1].u32Size;
            NuBL_CalculateSHA256(start, end, (uint32_t *)au32Hash, SHA_CONTI_END, SHA_SRC_FLASH);
        }

        if(memcmp(&au32Hash[0], &FwInfo.au32FwHash[0], (HASH_SIZE / 8)) != 0)
        {
            uint32_t *tmp;
            tmp = (uint32_t *)&au32Hash;
            NUBL_MSG("Verify NuBL3%d F/W Hash [FAIL]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
            NUBL_MSG("F/W Hash:\n");
            for(i = 0; i < ((HASH_SIZE / 8) / 4); i++)
                NUBL_MSG("\t%d: 0x%08x - 0x%08x.\n", i, tmp[i], FwInfo.au32FwHash[i]);
            ret = -5001;
            goto _exit_NuBL2_ExecuteVerifyNuBL3x;
        }
        NUBL_MSG("Verify NuBL3%d F/W Hash [PASS]\n\n", ((mode & BIT0) == 0) ? 2 : 3);
    }
    ret = 0;

_exit_NuBL2_ExecuteVerifyNuBL3x:
    SYS_ResetModule(CRPT_RST);

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&Hash,   0x0, sizeof(Hash));
    memset(&PubKey, 0x0, sizeof(ECC_PUBKEY_T));
    memset(&FwInfo, 0x0, sizeof(FW_INFO_T));

    return ret;
}

/*
    Return
        (NuBL2_priv * NuBL32_pub) ECDH key in Key32[]
        (NuBL2_priv * NuBL33_pub) ECDH key in Key33[]
*/
int32_t NuBL2_GetNuBL3xECDHKeys(uint32_t Key32[], uint32_t Key33[])
{
    volatile int32_t    i, ret = -1000;
    uint32_t            *keybuf, base, len;
    ECC_PUBKEY_T        PubKey;
    uint32_t            AESkey[8];

    if((ret = IsAccessDenied()) != 0)
        return ret;

    NUBL_MSG("\nCalculate (NuBL2*NuBL3) and (NuBL2*NuBL33) ECDH keys.\n\n");

    GetNuBL2AES256Key(AESkey);

    for(i = 0; i < 8; i++)
        NUBL_MSG("\tSharedKey: 0x%08x. (NuBL2_priv * NuBL1_pub)\n", AESkey[i]);

    /* Get encrypted NuBL32 public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    extern uint32_t g_NuBL32EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
    base = (uint32_t)&g_NuBL32EnCryptPubKeyBase;  /* encrypted NuBL32 pub key address */
    keybuf = (uint32_t *)&PubKey;
    for(i = 0; i < (len / 4); i++)
        keybuf[i] = FMC_Read(base + (i * 4));

    /* Trigger decryption... */
    if(NuBL_AES256Decrypt(keybuf, keybuf, len, AESkey) != 0)
    {
        ret = -1003;
        goto _exit_NuBL2_GetNuBL3xECDHKeys;
    }

    /* Step 2. Calculate (NuBL2 * NuBL32) ECDH key */
    /* Init ECC */
    if(NuBL_ECCInitCurve() != 0)
    {
        ret = -2001;
        goto _exit_NuBL2_GetNuBL3xECDHKeys;
    }

    /* Select NuBL2_priv * NuBL32_pub */
    SetECCRegisters(0x00020000, NULL, (uint32_t *)&PubKey);

    /* Calculate ECDH shared key */
    if(NuBL_ECCGenerateECDHKey() != 0)
    {
        ret = -2002;
        goto _exit_NuBL2_GetNuBL3xECDHKeys;
    }

    /* Get ECDH shared key */
    memcpy(Key32, (void *)&CRPT->ECC_X1[0], sizeof(AESkey));
    NuBL2_BytesSwap((char *)Key32, sizeof(AESkey));
    for(i = 0; i < 8; i++)
        Key32[i] = NuBL_Swap32(Key32[i]);
    for(i = 0; i < 8; i++)
        NUBL_MSG("\tSharedKey: 0x%08x. (NuBL2_priv * NuBL32_pub)\n", Key32[i]);


    /* Step 3. Decrypt NuBL33 public key */
    /* Get encrypted NuBL33 public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    extern uint32_t g_NuBL33EnCryptPubKeyBase;  /* declared in LoadKeyStorage.s */
    base = (uint32_t)&g_NuBL33EnCryptPubKeyBase;  /* encrypted NuBL33 pub key address */
    keybuf = (uint32_t *)&PubKey;
    for(i = 0; i < (len / 4); i++)
        keybuf[i] = FMC_Read(base + (i * 4));

    /* Trigger decryption... */
    if(NuBL_AES256Decrypt(keybuf, keybuf, len, AESkey) != 0)
    {
        ret = -3001;
        goto _exit_NuBL2_GetNuBL3xECDHKeys;
    }

    /* Step 4. Calculate (NuBL2 * NuBL33) ECDH key */
    /* Init ECC */
    if(NuBL_ECCInitCurve() != 0)
    {
        ret = -4001;
        goto _exit_NuBL2_GetNuBL3xECDHKeys;
    }

    /* Select NuBL2_priv * NuBL33_pub */
    SetECCRegisters(0x00020000, NULL, (uint32_t *)&PubKey);

