OpenNuvoton/M2354BSP/SampleCode/SecureApplication/SecureOTABankSwapDemo/NuBL2/NuBL2_lib0.c
    /* Calculate ECDH shared key */
    if(NuBL_ECCGenerateECDHKey() != 0)
    {
        ret = -4002;
        goto _exit_NuBL2_GetNuBL3xECDHKeys;
    }

    /* Get ECDH shared key */
    memcpy(Key33, (void *)&CRPT->ECC_X1[0], sizeof(AESkey));
    NuBL2_BytesSwap((char *)Key33, sizeof(AESkey));
    for(i = 0; i < 8; i++)
        Key33[i] = NuBL_Swap32(Key33[i]);
    for(i = 0; i < 8; i++)
        NUBL_MSG("\tSharedKey: 0x%08x. (NuBL2_priv * NuBL33_pub)\n", Key33[i]);

    ret = 0;

_exit_NuBL2_GetNuBL3xECDHKeys:
    SYS_ResetModule(CRPT_RST);

    memset(&AESkey, 0x0, sizeof(AESkey));
    memset(&PubKey, 0x0, sizeof(PubKey));

    return ret;
}

/*
    Update NuBL3x F/W info to specify destination address
*/
int32_t NuBL2_UpdateNuBL3xFwInfo(uint32_t *pFwInfo, uint32_t size, int32_t mode, uint32_t dest)
{
    volatile int32_t    i, ret = -1000;
    uint32_t            base;

    if((mode == -1) || (pFwInfo == NULL))
        return -1;

    if((ret = IsAccessDenied()) != 0)
        return ret;

    NUBL_MSG("\nNuBL2 update NuBL3%d F/W info.\n\n", (mode == 0) ? 2 : 3);

    if(mode == 0)
        base = NUBL32_FW_INFO_BASE;
    else
        base = NUBL33_FW_INFO_BASE;

    /* Write new firmware into another Flash bank. */
    if((FMC->ISPSTS & FMC_ISPSTS_FBS_Msk) == 0)
        base |= FMC_BANK_SIZE;

    for(i = 0; i < (size + (FMC_FLASH_PAGE_SIZE - 1)) / FMC_FLASH_PAGE_SIZE; i++)
        FMC_Erase(base + (i * FMC_FLASH_PAGE_SIZE));

    NUBL_MSG("\tProgram data to 0x%x, and total %d bytes.\n", base, size);
    for(i = 0; i < (size / 4); i++)
    {
        FMC_Write(base + (i * 4), pFwInfo[i]);
        if(FMC_Read(base + (i * 4)) != pFwInfo[i])
        {
            NUBL_MSG("[FAIL] W: 0x%x, R: 0x%x on addr 0x%x.\n\n", pFwInfo[i], FMC_Read(base + (i * 4)), base + (i * 4));
            return -1001;
        }
    }
    NUBL_MSG("\t[Done]\n\n");

    return 0;
}

void NuBL2_BytesSwap(char *buf, int32_t len)
{
    int32_t i;
    char    tmp;

    for(i = 0; i < (len / 2); i++)
    {
        tmp = buf[len - i - 1];
        buf[len - i - 1] = buf[i];
        buf[i] = tmp;
    }
}

/*
    To verify ECDSA (R, S) signature
*/
int32_t NuBL2_VerifyNuBL3xECDSASignature(uint32_t *msg, ECDSA_SIGN_T *sign, ECC_PUBKEY_T *pubkey, int32_t mode)
{
    volatile int32_t    ret;
    uint32_t    m[8], k0[8], k1[8], r[8], s[8];

    if(mode == -1)
        return ret;

    if((ret = IsAccessDenied()) != 0)
        return ret;

    NUBL_MSG("\nNuBL2 verify NuBL3%d FW info signature.\n", ((mode & BIT0) == 0) ? 2 : 3);

    memcpy(&m,  &msg[0], sizeof(m));
    memcpy(&k0, (uint32_t *)&pubkey->au32Key0[0], sizeof(k0));
    memcpy(&k1, (uint32_t *)&pubkey->au32Key1[0], sizeof(k1));
    memcpy(&r,  &sign->au32R[0], sizeof(r));
    memcpy(&s,  &sign->au32S[0], sizeof(s));
    NuBL2_BytesSwap((char*)m,  sizeof(m));
    NuBL2_BytesSwap((char*)k0, sizeof(k0));
    NuBL2_BytesSwap((char*)k1, sizeof(k1));
    NuBL2_BytesSwap((char*)r,  sizeof(r));
    NuBL2_BytesSwap((char*)s,  sizeof(s));

    ret = NuBL_VerifyECCSignature(m, k0, k1, r, s);

    return ret;
}

uint16_t cmd_CalCRC16Sum(uint32_t *pu32buf, uint32_t len)
{
    volatile uint32_t   i;
    uint16_t            *pu16buf;

    if(len > 56) // data byte count
        return -1;

    CLK->AHBCLK |= CLK_AHBCLK_CRCCKEN_Msk;
    CRC->SEED = 0xFFFFFFFFul;
    CRC->CTL = (CRC_16 | CRC_CPU_WDATA_16) | CRC_CTL_CRCEN_Msk;
    CRC->CTL |= CRC_CTL_CHKSINIT_Msk;

    pu16buf = (uint16_t *)pu32buf;
    CRC->DAT = *(pu16buf + 1);
    CRC->DAT = *(pu16buf + 2);
    CRC->DAT = *(pu16buf + 3);

    for(i = 0; i < (len / 2); i++)
        CRC->DAT = *(pu16buf + 4 + i);

    *(pu16buf + 0) = (CRC->CHECKSUM & 0xFFFF);

    /* Clear CRC checksum */
    CRC->SEED = 0xFFFFFFFFul;
    CRC->CTL |= CRC_CTL_CHKSINIT_Msk;

    return *(pu16buf + 0);
}

int32_t cmd_VerifyCRC16Sum(uint32_t *pu32buf)
{
    volatile uint32_t   i, len;
    uint16_t            *pu16buf, ChkSum0, ChkSum1;

    pu16buf = (uint16_t *)pu32buf;
    len = pu32buf[1];
    if(len > 56) // data byte count
        return -1;

    CLK->AHBCLK |= CLK_AHBCLK_CRCCKEN_Msk;
    CRC->SEED = 0xFFFFFFFFul;
    CRC->CTL = (CRC_16 | CRC_CPU_WDATA_16) | CRC_CTL_CRCEN_Msk;
    CRC->CTL |= CRC_CTL_CHKSINIT_Msk;

    CRC->DAT = *(pu16buf + 1);
    CRC->DAT = *(pu16buf + 2);
    CRC->DAT = *(pu16buf + 3);

    for(i = 0; i < (len / 2); i++)
        CRC->DAT = *(pu16buf + 4 + i);

    ChkSum0 = *(pu16buf + 0);
    ChkSum1 = (CRC->CHECKSUM & 0xFFFF);

    /* Clear CRC checksum */
    CRC->SEED = 0xFFFFFFFFul;
    CRC->CTL |= CRC_CTL_CHKSINIT_Msk;

    /* Verify CRC16 checksum */
    if(ChkSum0 == ChkSum1)
        return 0;       /* Verify CRC16 Pass */
    else
        return ChkSum1; /* Verify CRC16 Fail */
}

int32_t GenCmdSessionKey(uint32_t key[])
{
    volatile int32_t    i, ret = -1000;
    uint32_t            *keybuf, *infobuf, base, len, start, end;
    ECC_PUBKEY_T        PubKey;
    uint32_t            AESkey[8], Hash[8], HashValue[8];;

    memset(&AESkey, 0x0, sizeof(AESkey));

    /* Check Host Key Storage Hash */
    /* Get encrypted Host public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    extern uint32_t g_HostEnCryptPubKeyBase;  /* declared in LoadHostKey.s */
    base = (uint32_t)&g_HostEnCryptPubKeyBase;  /* encrypted Host pub key address */
    keybuf = (uint32_t *)&PubKey;
    for(i = 0; i < (len / 4); i++)
        keybuf[i] = inpw(base + (i * 4));

    start = (uint32_t)&PubKey;
    end   = (uint32_t)&PubKey + len;
    NuBL_CalculateSHA256(start, end, (uint32_t *)Hash, SHA_ONESHOT, SHA_SRC_SRAM);

    /* Get Hash value of encrypted Host public key from Key Storage Hash base */
    len = sizeof(ECC_PUBKEY_T);
    extern uint32_t g_HostEnCryptPubKeyHashBase;  /* declared in LoadKeyStorage.s */
    base = (uint32_t)&g_HostEnCryptPubKeyHashBase;  /* encrypted Host pub key hash address */
    start = base;
    end   = base + sizeof(Hash);
    keybuf = (uint32_t *)&HashValue;
    for(i = 0; i < (sizeof(HashValue) / 4); i++)
        keybuf[i] = inpw(base + (i * 4));

    if(memcmp(&Hash[0], &HashValue[0], (HASH_SIZE / 8)) != 0)
    {
        uint32_t *tmp;
        tmp = (uint32_t *)&Hash;
        NUBL_MSG("Verify Host pub key Hash [FAIL]\n\n");
        NUBL_MSG("Key Hash:\n");
        for(i = 0; i < ((HASH_SIZE / 8) / 4); i++)
            NUBL_MSG("\t%d: 0x%08x - 0x%08x.\n", i, Hash[i], HashValue[i]);
        ret = -5001;
        goto _exit_GenCmdSessionKey;
    }
    NUBL_MSG("Verify Host Key Storage Hash [PASS]\n\n");


    GetNuBL2AES256Key(AESkey);

    /* Get encrypted Host public key from Key Storage */
    len = sizeof(ECC_PUBKEY_T);
    base = (uint32_t)&g_HostEnCryptPubKeyBase;  /* encrypted Host pub key address */

    keybuf = (uint32_t *)&PubKey;
    for(i = 0; i < (len / 4); i++)
        keybuf[i] = FMC_Read(base + (i * 4));

    /* Trigger decryption... */
    if(NuBL_AES256Decrypt(keybuf, keybuf, len, AESkey) != 0)
    {
        ret = -1003;
        goto _exit_GenCmdSessionKey;
    }


